cf/Documents/Netting.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>Netting</Name>
			<BasedOn>
				<xr:Item>Document.SettlementsReconciliation</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.InvoicesAndOrdersPayment</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpensesCashMethod</xr:Item>
				<xr:Item>AccountingRegister.Managerial</xr:Item>
				<xr:Item>AccumulationRegister.AccountsReceivable</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpenses</xr:Item>
				<xr:Item>AccumulationRegister.AccountsPayable</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpensesRetained</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpensesUndistributed</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OperationKindsNetting</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartySource</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Multiplicity</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Multiplicity</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ExchangeRate</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettlementsAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountingAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Correspondence</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountsDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.FixedAssetsTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.AgentReport</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.AcceptanceCertificate</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
						<v8:Type>cfg:DocumentRef.ProcessingReport</v8:Type>
						<v8:Type>cfg:DocumentRef.ExpenseReport</v8:Type>
						<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.SubcontractorReport</v8:Type>
						<v8:Type>cfg:DocumentRef.ReportToPrincipal</v8:Type>
						<v8:Type>cfg:DocumentRef.CashPayment</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.AdditionalCosts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdvanceFlag</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Order</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InvoiceForPayment</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.InvoiceForPayment</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoiceForPayment</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BasisDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SettlementsReconciliation</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteBasisDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SettlementsReconciliation</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Debitor</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Contract</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.FixedAssetsTransfer</v8:Type>
								<v8:Type>cfg:DocumentRef.CustomerInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.AgentReport</v8:Type>
								<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.AcceptanceCertificate</v8:Type>
								<v8:Type>cfg:DocumentRef.ProcessingReport</v8:Type>
								<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
								<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.Netting</v8:Type>
								<v8:Type>cfg:DocumentRef.PaymentReceipt</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Order</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Multiplicity</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Multiplicity</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExchangeRate</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ExchangeRate</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AdvanceFlag</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SettlementsAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountingAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>InvoiceForPayment</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.InvoiceForPayment</v8:Type>
								<v8:Type>cfg:DocumentRef.SupplierInvoiceForPayment</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Creditor</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Contract</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
								<v8:Type>cfg:DocumentRef.ExpenseReport</v8:Type>
								<v8:Type>cfg:DocumentRef.SubcontractorReport</v8:Type>
								<v8:Type>cfg:DocumentRef.ReportToPrincipal</v8:Type>
								<v8:Type>cfg:DocumentRef.CashPayment</v8:Type>
								<v8:Type>cfg:DocumentRef.Netting</v8:Type>
								<v8:Type>cfg:DocumentRef.AdditionalCosts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Order</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Multiplicity</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Multiplicity</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExchangeRate</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ExchangeRate</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AdvanceFlag</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SettlementsAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountingAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>InvoiceForPayment</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.InvoiceForPayment</v8:Type>
								<v8:Type>cfg:DocumentRef.SupplierInvoiceForPayment</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Enums/ContractKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>ContractKinds</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>WithVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WithCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromPrincipal</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WithAgent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/OperationKindsNetting.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>OperationKindsNetting</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Netting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerDebtAssignment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DebtAssignmentToVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerDebtAdjustment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VendorDebtAdjustment</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/Netting/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

///////////////////////////////////////////////////////////////////////////////
// PROCEDURES AND FUNCTIONS OF DOCUMENT FILLING

//Procedure of document filling based on the settlement reconciliation
//
Procedure FillBySettlementsReconciliation(DocumentSettlementsReconciliation)
	
	ThisObject.BasisDocument 	= DocumentSettlementsReconciliation;
	ThisObject.Company			= DocumentSettlementsReconciliation.Company;
	For Each CounterpartyContractString IN DocumentSettlementsReconciliation.CounterpartyContracts Do
		
		If CounterpartyContractString.Select Then
			
			CounterpartyContract = CounterpartyContractString.Contract;
			Break;
			
		EndIf;
		
	EndDo;
	
	If ValueIsFilled(CounterpartyContract) Then
		
		If CounterpartyContract.ContractKind = Enums.ContractKinds.WithCustomer 
			OR CounterpartyContract.ContractKind = Enums.ContractKinds.WithAgent Then
			
			ThisObject.OperationKind			= Enums.OperationKindsNetting.CustomerDebtAdjustment;
			ThisObject.CounterpartySource	= DocumentSettlementsReconciliation.Counterparty;
			
		ElsIf CounterpartyContract.ContractKind = Enums.ContractKinds.WithVendor 
			OR CounterpartyContract.ContractKind = Enums.ContractKinds.FromPrincipal Then
			
			ThisObject.OperationKind			= Enums.OperationKindsNetting.VendorDebtAdjustment;
			ThisObject.Counterparty			= DocumentSettlementsReconciliation.Counterparty;
			
		EndIf;
		
		BalanceByCompanyData	= DocumentSettlementsReconciliation.CompanyData.Total("ClientDebtAmount") - DocumentSettlementsReconciliation.CompanyData.Total("CompanyDebtAmount");
		BalanceByCounterpartyData	= DocumentSettlementsReconciliation.CounterpartyData.Total("CompanyDebtAmount") - DocumentSettlementsReconciliation.CounterpartyData.Total("ClientDebtAmount");
		Discrepancy					= BalanceByCompanyData - BalanceByCounterpartyData;
		
		Correspondence = ?(Discrepancy < 0, ChartsOfAccounts.Managerial.OtherIncome, ChartsOfAccounts.Managerial.OtherExpenses);
		
	EndIf;
	
EndProcedure //FillBySettlementsReconciliation()

////////////////////////////////////////////////////////////////////////////////
// EVENT HANDLERS

// Procedure - event handler BeforeWrite object.
//
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not ValueIsFilled(AccountsDocument) Then
		AccountsDocument = Undefined;
	EndIf;
	
	For Each CurRow IN Debitor Do
		If Not ValueIsFilled(CurRow.Document) Then
			CurRow.Document = Undefined;
		EndIf;
	EndDo;
	
	For Each CurRow IN Creditor Do
		If Not ValueIsFilled(CurRow.Document) Then
			CurRow.Document = Undefined;
		EndIf;
	EndDo;
	
	If Not ValueIsFilled(Order) Then
		If OperationKind = Enums.OperationKindsNetting.CustomerDebtAssignment Then
			Order = Documents.CustomerOrder.EmptyRef();
		ElsIf OperationKind = Enums.OperationKindsNetting.DebtAssignmentToVendor Then
			Order = Documents.PurchaseOrder.EmptyRef();
		EndIf;
	EndIf;
	
EndProcedure // BeforeWrite()

// Procedure - event handler FillCheckProcessing object.
//
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If OperationKind = Enums.OperationKindsNetting.Netting Then
		
		DebitorSumOfAccounting = Debitor.Total("AccountingAmount");
		CreditorAccountingSum = Creditor.Total("AccountingAmount");
		
		If DebitorSumOfAccounting <> CreditorAccountingSum Then
			MessageText = NStr("en='Account amount of the tabular section ""Accounts receivable"" is not equal to account amount in the tabular section ""Accounts payable""!';ru='Сумма учета табличной части ""Расчеты с покупателем"", не равна сумме учета по табличной части ""Расчеты с поставщиком""!'");
			SmallBusinessServer.ShowMessageAboutError(
				ThisObject,
				MessageText,
				"Debitor",
				1,
				"AccountingAmount",
				Cancel
			);
		EndIf;
		
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Contract");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "SettlementsAmount");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "ExchangeRate");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Multiplicity");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "AccountingAmount");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Correspondence");
		
		If Not CounterpartySource.DoOperationsByContracts Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Debitor.Contract");
			For Each TSRow IN Debitor Do
				TSRow.Contract = CounterpartySource.ContractByDefault;
			EndDo;
		EndIf;
		
		If Not CounterpartySource.DoOperationsByDocuments Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Debitor.Document");
		EndIf;
		
		If Not Counterparty.DoOperationsByContracts Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Creditor.Contract");
			For Each TSRow IN Creditor Do
				TSRow.Contract = Counterparty.ContractByDefault;
			EndDo;
		EndIf;
		
		If Not Counterparty.DoOperationsByDocuments Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Creditor.Document");
		EndIf;
		
	ElsIf OperationKind = Enums.OperationKindsNetting.CustomerDebtAssignment Then
		
		DebitorSumOfAccounting = Debitor.Total("AccountingAmount");
		MessageText = NStr("en='Account amount is not equal to amount in the tabular section ""Accounts receivable""!';ru='Сумма учета, не равна сумме учета табличной части ""Расчеты с покупателем""!'");
		
		If DebitorSumOfAccounting <> AccountingAmount Then
			SmallBusinessServer.ShowMessageAboutError(
				ThisObject,
				MessageText,
				Undefined,
				1,
				"AccountingAmount",
				Cancel
			);
		EndIf;
		
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Correspondence");
		
		If Not CounterpartySource.DoOperationsByContracts Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Debitor.Contract");
			For Each TSRow IN Debitor Do
				TSRow.Contract = CounterpartySource.ContractByDefault;
			EndDo;
		EndIf;
		
		If Not CounterpartySource.DoOperationsByDocuments Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Debitor.Document");
		EndIf;
		
		If Not Counterparty.DoOperationsByContracts Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Contract");
			Contract = Counterparty.ContractByDefault;
		EndIf;
		
		If Not Counterparty.DoOperationsByDocuments Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Document");
		EndIf;

	ElsIf OperationKind = Enums.OperationKindsNetting.DebtAssignmentToVendor Then
		
		CreditorAccountingSum = Creditor.Total("AccountingAmount");
		
		If CreditorAccountingSum <> AccountingAmount Then
			MessageText = NStr("en='Account amount is not equal to amount in the tabular section ""Accounts payable""!';ru='Сумма учета, не равна сумме учета табличной части ""Расчеты с поставщиком""!'");
			SmallBusinessServer.ShowMessageAboutError(
				ThisObject,
				MessageText,
				Undefined,
				1,
				"AccountingAmount",
				Cancel
			);
		EndIf;
		
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Correspondence");
		
		If Not CounterpartySource.DoOperationsByContracts Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Creditor.Contract");
			For Each TSRow IN Creditor Do
				TSRow.Contract = CounterpartySource.ContractByDefault;
			EndDo;
		EndIf;
		
		If Not CounterpartySource.DoOperationsByDocuments Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Creditor.Document");
		EndIf;
		
		If Not Counterparty.DoOperationsByContracts Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Contract");
			Contract = Counterparty.ContractByDefault;
		EndIf;
		
		If Not Counterparty.DoOperationsByDocuments Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Document");
		EndIf;
		
	ElsIf OperationKind = Enums.OperationKindsNetting.CustomerDebtAdjustment Then
		
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Counterparty");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Contract");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "SettlementsAmount");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "ExchangeRate");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Multiplicity");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "AccountingAmount");
		
		If Not CounterpartySource.DoOperationsByContracts Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Debitor.Contract");
			For Each TSRow IN Debitor Do
				TSRow.Contract = CounterpartySource.ContractByDefault;
			EndDo;
		EndIf;
		
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Debitor.Document");
		
	ElsIf OperationKind = Enums.OperationKindsNetting.VendorDebtAdjustment Then
		
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "CounterpartySource");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Contract");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "SettlementsAmount");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "ExchangeRate");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Multiplicity");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "AccountingAmount");
		
		If Not Counterparty.DoOperationsByContracts Then
			SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Creditor.Contract");
			For Each TSRow IN Creditor Do
				TSRow.Contract = Counterparty.ContractByDefault;
			EndDo;
		EndIf;
			
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Creditor.Document");
		
	EndIf
	
EndProcedure // FillCheckProcessing()

// Procedure - event handler Posting object.
//
Procedure Posting(Cancel, PostingMode)
	
	// Initialization of additional properties for document posting.
	SmallBusinessServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Document data initialization.
	Documents.Netting.InitializeDocumentData(Ref, AdditionalProperties);
	
	// Preparation of records sets.
	SmallBusinessServer.PrepareRecordSetsForRecording(ThisObject);
	
	// Account for in accounting sections.
	SmallBusinessServer.ReflectAccountsReceivable(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectAccountsPayable(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectInvoicesAndOrdersPayment(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectIncomeAndExpenses(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectIncomeAndExpensesRetained(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectIncomeAndExpensesCashMethod(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectIncomeAndExpensesUndistributed(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectManagerial(AdditionalProperties, RegisterRecords, Cancel);
	
	// Record of the records sets.
	SmallBusinessServer.WriteRecordSets(ThisObject);
	
	// Control of occurrence of a negative balance.
	Documents.Netting.RunControl(Ref, AdditionalProperties, Cancel);
	
	AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
	
EndProcedure // Posting()

// Procedure - event handler UndoPosting object.
//
Procedure UndoPosting(Cancel)
	
	// Initialization of additional properties to undo the posting of a document.
	SmallBusinessServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Preparation of records sets.
	SmallBusinessServer.PrepareRecordSetsForRecording(ThisObject);
	
	// Record of the records sets.
	SmallBusinessServer.WriteRecordSets(ThisObject);
	
	// Control of occurrence of a negative balance.
	Documents.Netting.RunControl(Ref, AdditionalProperties, Cancel, True);
	
EndProcedure // UndoPosting()

//Procedure - handler of item event Filling
//
Procedure Filling(FillingData, StandardProcessing) Export
	
	If TypeOf(FillingData) = Type("DocumentRef.SettlementsReconciliation") Then
		
		FillBySettlementsReconciliation(FillingData);
		
	EndIf;
	
EndProcedure

#EndIf
